import { readFileSync } from 'fs';

const genDiff = (filepath1, filepath2) => {
  /* Требования: 
    Сравниваются данные, а не строки файлов.
    Две строчки дифа, отвечающие за различия поля, должны находиться рядом.
    Причём вначале должна выводиться строка относящаяся к первому файлу, а затем строка относящаяся ко второму файлу.
    Результатом работы функции genDiff() является строка. */

  // прочитать файл1
  // прочитать файл2
  // сравниваем ключи
  // если ключа нет, выводим ключ-занчение с минусом
  // если ключ есть - 
    // сравниваем занчения
    // если все совпало, просто выводим строку ключ-значение
    // если нет - выводим ключ-значение из первого файла, ниже - из второго
  const file1 = readFileSync(filepath1);
  const file2 = readFileSync(filepath2);
  
  const obj1 = JSON.parse(file1);
  const obj2 = JSON.parse(file2);

  console.log(obj1, obj2);
  
  const result = '';

  return result;
};

export default genDiff;